espressif/esp-idf/components/soc/esp32s31/register/soc/pmu_reg.h
/** PMU_HP_SLEEP_ICG_MODEM_REG register
 *  need_des
 */
#define PMU_HP_SLEEP_ICG_MODEM_REG (DR_REG_PMU_BASE + 0x94)
/** PMU_HP_SLEEP_DIG_ICG_MODEM_CODE : R/W; bitpos: [31:30]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP_DIG_ICG_MODEM_CODE    0x00000003U
#define PMU_HP_SLEEP_DIG_ICG_MODEM_CODE_M  (PMU_HP_SLEEP_DIG_ICG_MODEM_CODE_V << PMU_HP_SLEEP_DIG_ICG_MODEM_CODE_S)
#define PMU_HP_SLEEP_DIG_ICG_MODEM_CODE_V  0x00000003U
#define PMU_HP_SLEEP_DIG_ICG_MODEM_CODE_S  30

/** PMU_HP_SLEEP_HP_SYS_CNTL_REG register
 *  need_des
 */
#define PMU_HP_SLEEP_HP_SYS_CNTL_REG (DR_REG_PMU_BASE + 0x98)
/** PMU_HP_SLEEP_C_CHANNEL : R/W; bitpos: [23]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP_C_CHANNEL    (BIT(23))
#define PMU_HP_SLEEP_C_CHANNEL_M  (PMU_HP_SLEEP_C_CHANNEL_V << PMU_HP_SLEEP_C_CHANNEL_S)
#define PMU_HP_SLEEP_C_CHANNEL_V  0x00000001U
#define PMU_HP_SLEEP_C_CHANNEL_S  23
/** PMU_HP_SLEEP_UART_WAKEUP_EN : R/W; bitpos: [24]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP_UART_WAKEUP_EN    (BIT(24))
#define PMU_HP_SLEEP_UART_WAKEUP_EN_M  (PMU_HP_SLEEP_UART_WAKEUP_EN_V << PMU_HP_SLEEP_UART_WAKEUP_EN_S)
#define PMU_HP_SLEEP_UART_WAKEUP_EN_V  0x00000001U
#define PMU_HP_SLEEP_UART_WAKEUP_EN_S  24
/** PMU_HP_SLEEP_LP_PAD_HOLD_ALL : R/W; bitpos: [25]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP_LP_PAD_HOLD_ALL    (BIT(25))
#define PMU_HP_SLEEP_LP_PAD_HOLD_ALL_M  (PMU_HP_SLEEP_LP_PAD_HOLD_ALL_V << PMU_HP_SLEEP_LP_PAD_HOLD_ALL_S)
#define PMU_HP_SLEEP_LP_PAD_HOLD_ALL_V  0x00000001U
#define PMU_HP_SLEEP_LP_PAD_HOLD_ALL_S  25
/** PMU_HP_SLEEP_HP_PAD_HOLD_ALL : R/W; bitpos: [26]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP_HP_PAD_HOLD_ALL    (BIT(26))
#define PMU_HP_SLEEP_HP_PAD_HOLD_ALL_M  (PMU_HP_SLEEP_HP_PAD_HOLD_ALL_V << PMU_HP_SLEEP_HP_PAD_HOLD_ALL_S)
#define PMU_HP_SLEEP_HP_PAD_HOLD_ALL_V  0x00000001U
#define PMU_HP_SLEEP_HP_PAD_HOLD_ALL_S  26
/** PMU_HP_SLEEP_DIG_PAD_SLP_SEL : R/W; bitpos: [27]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP_DIG_PAD_SLP_SEL    (BIT(27))
#define PMU_HP_SLEEP_DIG_PAD_SLP_SEL_M  (PMU_HP_SLEEP_DIG_PAD_SLP_SEL_V << PMU_HP_SLEEP_DIG_PAD_SLP_SEL_S)
#define PMU_HP_SLEEP_DIG_PAD_SLP_SEL_V  0x00000001U
#define PMU_HP_SLEEP_DIG_PAD_SLP_SEL_S  27
/** PMU_HP_SLEEP_DIG_PAUSE_WDT : R/W; bitpos: [28]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP_DIG_PAUSE_WDT    (BIT(28))
#define PMU_HP_SLEEP_DIG_PAUSE_WDT_M  (PMU_HP_SLEEP_DIG_PAUSE_WDT_V << PMU_HP_SLEEP_DIG_PAUSE_WDT_S)
#define PMU_HP_SLEEP_DIG_PAUSE_WDT_V  0x00000001U
#define PMU_HP_SLEEP_DIG_PAUSE_WDT_S  28
/** PMU_HP_SLEEP_DIG_CPU_STALL : R/W; bitpos: [29]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP_DIG_CPU_STALL    (BIT(29))
#define PMU_HP_SLEEP_DIG_CPU_STALL_M  (PMU_HP_SLEEP_DIG_CPU_STALL_V << PMU_HP_SLEEP_DIG_CPU_STALL_S)
#define PMU_HP_SLEEP_DIG_CPU_STALL_V  0x00000001U
#define PMU_HP_SLEEP_DIG_CPU_STALL_S  29

/** PMU_HP_SLEEP_HP_CK_POWER_REG register
 *  need_des
 */
#define PMU_HP_SLEEP_HP_CK_POWER_REG (DR_REG_PMU_BASE + 0x9c)
/** PMU_HP_SLEEP_XPD_XTALX2 : R/W; bitpos: [19]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP_XPD_XTALX2    (BIT(19))
#define PMU_HP_SLEEP_XPD_XTALX2_M  (PMU_HP_SLEEP_XPD_XTALX2_V << PMU_HP_SLEEP_XPD_XTALX2_S)
#define PMU_HP_SLEEP_XPD_XTALX2_V  0x00000001U
#define PMU_HP_SLEEP_XPD_XTALX2_S  19
/** PMU_HP_SLEEP_I2C_ISO_EN : R/W; bitpos: [20]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP_I2C_ISO_EN    (BIT(20))
#define PMU_HP_SLEEP_I2C_ISO_EN_M  (PMU_HP_SLEEP_I2C_ISO_EN_V << PMU_HP_SLEEP_I2C_ISO_EN_S)
#define PMU_HP_SLEEP_I2C_ISO_EN_V  0x00000001U
#define PMU_HP_SLEEP_I2C_ISO_EN_S  20
/** PMU_HP_SLEEP_I2C_RETENTION : R/W; bitpos: [21]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP_I2C_RETENTION    (BIT(21))
#define PMU_HP_SLEEP_I2C_RETENTION_M  (PMU_HP_SLEEP_I2C_RETENTION_V << PMU_HP_SLEEP_I2C_RETENTION_S)
#define PMU_HP_SLEEP_I2C_RETENTION_V  0x00000001U
#define PMU_HP_SLEEP_I2C_RETENTION_S  21
/** PMU_HP_SLEEP_XPD_BB_I2C : R/W; bitpos: [22]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP_XPD_BB_I2C    (BIT(22))
#define PMU_HP_SLEEP_XPD_BB_I2C_M  (PMU_HP_SLEEP_XPD_BB_I2C_V << PMU_HP_SLEEP_XPD_BB_I2C_S)
#define PMU_HP_SLEEP_XPD_BB_I2C_V  0x00000001U
#define PMU_HP_SLEEP_XPD_BB_I2C_S  22
/** PMU_HP_SLEEP_XPD_CPLL_I2C : R/W; bitpos: [23]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP_XPD_CPLL_I2C    (BIT(23))
#define PMU_HP_SLEEP_XPD_CPLL_I2C_M  (PMU_HP_SLEEP_XPD_CPLL_I2C_V << PMU_HP_SLEEP_XPD_CPLL_I2C_S)
#define PMU_HP_SLEEP_XPD_CPLL_I2C_V  0x00000001U
#define PMU_HP_SLEEP_XPD_CPLL_I2C_S  23
/** PMU_HP_SLEEP_XPD_BBPLL_I2C : R/W; bitpos: [24]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP_XPD_BBPLL_I2C    (BIT(24))
#define PMU_HP_SLEEP_XPD_BBPLL_I2C_M  (PMU_HP_SLEEP_XPD_BBPLL_I2C_V << PMU_HP_SLEEP_XPD_BBPLL_I2C_S)
#define PMU_HP_SLEEP_XPD_BBPLL_I2C_V  0x00000001U
#define PMU_HP_SLEEP_XPD_BBPLL_I2C_S  24
/** PMU_HP_SLEEP_XPD_APLL_I2C : R/W; bitpos: [25]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP_XPD_APLL_I2C    (BIT(25))
#define PMU_HP_SLEEP_XPD_APLL_I2C_M  (PMU_HP_SLEEP_XPD_APLL_I2C_V << PMU_HP_SLEEP_XPD_APLL_I2C_S)
#define PMU_HP_SLEEP_XPD_APLL_I2C_V  0x00000001U
#define PMU_HP_SLEEP_XPD_APLL_I2C_S  25
/** PMU_HP_SLEEP_XPD_MPLL_I2C : R/W; bitpos: [26]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP_XPD_MPLL_I2C    (BIT(26))
#define PMU_HP_SLEEP_XPD_MPLL_I2C_M  (PMU_HP_SLEEP_XPD_MPLL_I2C_V << PMU_HP_SLEEP_XPD_MPLL_I2C_S)
#define PMU_HP_SLEEP_XPD_MPLL_I2C_V  0x00000001U
#define PMU_HP_SLEEP_XPD_MPLL_I2C_S  26
/** PMU_HP_SLEEP_XPD_CPLL : R/W; bitpos: [27]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP_XPD_CPLL    (BIT(27))
#define PMU_HP_SLEEP_XPD_CPLL_M  (PMU_HP_SLEEP_XPD_CPLL_V << PMU_HP_SLEEP_XPD_CPLL_S)
#define PMU_HP_SLEEP_XPD_CPLL_V  0x00000001U
#define PMU_HP_SLEEP_XPD_CPLL_S  27
/** PMU_HP_SLEEP_XPD_BBPLL : R/W; bitpos: [28]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP_XPD_BBPLL    (BIT(28))
#define PMU_HP_SLEEP_XPD_BBPLL_M  (PMU_HP_SLEEP_XPD_BBPLL_V << PMU_HP_SLEEP_XPD_BBPLL_S)
#define PMU_HP_SLEEP_XPD_BBPLL_V  0x00000001U
#define PMU_HP_SLEEP_XPD_BBPLL_S  28
/** PMU_HP_SLEEP_XPD_APLL : R/W; bitpos: [29]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP_XPD_APLL    (BIT(29))
#define PMU_HP_SLEEP_XPD_APLL_M  (PMU_HP_SLEEP_XPD_APLL_V << PMU_HP_SLEEP_XPD_APLL_S)
#define PMU_HP_SLEEP_XPD_APLL_V  0x00000001U
#define PMU_HP_SLEEP_XPD_APLL_S  29
/** PMU_HP_SLEEP_XPD_MPLL : R/W; bitpos: [30]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP_XPD_MPLL    (BIT(30))
#define PMU_HP_SLEEP_XPD_MPLL_M  (PMU_HP_SLEEP_XPD_MPLL_V << PMU_HP_SLEEP_XPD_MPLL_S)
#define PMU_HP_SLEEP_XPD_MPLL_V  0x00000001U
#define PMU_HP_SLEEP_XPD_MPLL_S  30

