espressif/esp-idf/components/soc/esp32s31/register/soc/pmu_reg.h
/** PMU_POWER_PD_MODEM_PWR_CNTL_REG register
 *  need_des
 */
#define PMU_POWER_PD_MODEM_PWR_CNTL_REG (DR_REG_PMU_BASE + 0x128)
/** PMU_FORCE_MODEM_PWR_RESET : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define PMU_FORCE_MODEM_PWR_RESET    (BIT(0))
#define PMU_FORCE_MODEM_PWR_RESET_M  (PMU_FORCE_MODEM_PWR_RESET_V << PMU_FORCE_MODEM_PWR_RESET_S)
#define PMU_FORCE_MODEM_PWR_RESET_V  0x00000001U
#define PMU_FORCE_MODEM_PWR_RESET_S  0
/** PMU_FORCE_MODEM_PWR_ISO : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define PMU_FORCE_MODEM_PWR_ISO    (BIT(1))
#define PMU_FORCE_MODEM_PWR_ISO_M  (PMU_FORCE_MODEM_PWR_ISO_V << PMU_FORCE_MODEM_PWR_ISO_S)
#define PMU_FORCE_MODEM_PWR_ISO_V  0x00000001U
#define PMU_FORCE_MODEM_PWR_ISO_S  1
/** PMU_FORCE_MODEM_PWR_PU : R/W; bitpos: [2]; default: 1;
 *  need_des
 */
#define PMU_FORCE_MODEM_PWR_PU    (BIT(2))
#define PMU_FORCE_MODEM_PWR_PU_M  (PMU_FORCE_MODEM_PWR_PU_V << PMU_FORCE_MODEM_PWR_PU_S)
#define PMU_FORCE_MODEM_PWR_PU_V  0x00000001U
#define PMU_FORCE_MODEM_PWR_PU_S  2
/** PMU_FORCE_MODEM_PWR_NO_RESET : R/W; bitpos: [3]; default: 1;
 *  need_des
 */
#define PMU_FORCE_MODEM_PWR_NO_RESET    (BIT(3))
#define PMU_FORCE_MODEM_PWR_NO_RESET_M  (PMU_FORCE_MODEM_PWR_NO_RESET_V << PMU_FORCE_MODEM_PWR_NO_RESET_S)
#define PMU_FORCE_MODEM_PWR_NO_RESET_V  0x00000001U
#define PMU_FORCE_MODEM_PWR_NO_RESET_S  3
/** PMU_FORCE_MODEM_PWR_NO_ISO : R/W; bitpos: [4]; default: 1;
 *  need_des
 */
#define PMU_FORCE_MODEM_PWR_NO_ISO    (BIT(4))
#define PMU_FORCE_MODEM_PWR_NO_ISO_M  (PMU_FORCE_MODEM_PWR_NO_ISO_V << PMU_FORCE_MODEM_PWR_NO_ISO_S)
#define PMU_FORCE_MODEM_PWR_NO_ISO_V  0x00000001U
#define PMU_FORCE_MODEM_PWR_NO_ISO_S  4
/** PMU_FORCE_MODEM_PWR_PD : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define PMU_FORCE_MODEM_PWR_PD    (BIT(5))
#define PMU_FORCE_MODEM_PWR_PD_M  (PMU_FORCE_MODEM_PWR_PD_V << PMU_FORCE_MODEM_PWR_PD_S)
#define PMU_FORCE_MODEM_PWR_PD_V  0x00000001U
#define PMU_FORCE_MODEM_PWR_PD_S  5
/** PMU_PD_MODEM_PWR_MASK : R/W; bitpos: [10:6]; default: 0;
 *  need_des
 */
#define PMU_PD_MODEM_PWR_MASK    0x0000001FU
#define PMU_PD_MODEM_PWR_MASK_M  (PMU_PD_MODEM_PWR_MASK_V << PMU_PD_MODEM_PWR_MASK_S)
#define PMU_PD_MODEM_PWR_MASK_V  0x0000001FU
#define PMU_PD_MODEM_PWR_MASK_S  6
/** PMU_PD_MODEM_PWR_PD_MASK : R/W; bitpos: [31:27]; default: 0;
 *  need_des
 */
#define PMU_PD_MODEM_PWR_PD_MASK    0x0000001FU
#define PMU_PD_MODEM_PWR_PD_MASK_M  (PMU_PD_MODEM_PWR_PD_MASK_V << PMU_PD_MODEM_PWR_PD_MASK_S)
#define PMU_PD_MODEM_PWR_PD_MASK_V  0x0000001FU
#define PMU_PD_MODEM_PWR_PD_MASK_S  27

/** PMU_POWER_PD_HPCPU_CNTL_REG register
 *  need_des
 */
#define PMU_POWER_PD_HPCPU_CNTL_REG (DR_REG_PMU_BASE + 0x12c)
/** PMU_FORCE_HP_CPU_RESET : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define PMU_FORCE_HP_CPU_RESET    (BIT(0))
#define PMU_FORCE_HP_CPU_RESET_M  (PMU_FORCE_HP_CPU_RESET_V << PMU_FORCE_HP_CPU_RESET_S)
#define PMU_FORCE_HP_CPU_RESET_V  0x00000001U
#define PMU_FORCE_HP_CPU_RESET_S  0
/** PMU_FORCE_HP_CPU_ISO : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define PMU_FORCE_HP_CPU_ISO    (BIT(1))
#define PMU_FORCE_HP_CPU_ISO_M  (PMU_FORCE_HP_CPU_ISO_V << PMU_FORCE_HP_CPU_ISO_S)
#define PMU_FORCE_HP_CPU_ISO_V  0x00000001U
#define PMU_FORCE_HP_CPU_ISO_S  1
/** PMU_FORCE_HP_CPU_PU : R/W; bitpos: [2]; default: 1;
 *  need_des
 */
#define PMU_FORCE_HP_CPU_PU    (BIT(2))
#define PMU_FORCE_HP_CPU_PU_M  (PMU_FORCE_HP_CPU_PU_V << PMU_FORCE_HP_CPU_PU_S)
#define PMU_FORCE_HP_CPU_PU_V  0x00000001U
#define PMU_FORCE_HP_CPU_PU_S  2
/** PMU_FORCE_HP_CPU_NO_RESET : R/W; bitpos: [3]; default: 1;
 *  need_des
 */
#define PMU_FORCE_HP_CPU_NO_RESET    (BIT(3))
#define PMU_FORCE_HP_CPU_NO_RESET_M  (PMU_FORCE_HP_CPU_NO_RESET_V << PMU_FORCE_HP_CPU_NO_RESET_S)
#define PMU_FORCE_HP_CPU_NO_RESET_V  0x00000001U
#define PMU_FORCE_HP_CPU_NO_RESET_S  3
/** PMU_FORCE_HP_CPU_NO_ISO : R/W; bitpos: [4]; default: 1;
 *  need_des
 */
#define PMU_FORCE_HP_CPU_NO_ISO    (BIT(4))
#define PMU_FORCE_HP_CPU_NO_ISO_M  (PMU_FORCE_HP_CPU_NO_ISO_V << PMU_FORCE_HP_CPU_NO_ISO_S)
#define PMU_FORCE_HP_CPU_NO_ISO_V  0x00000001U
#define PMU_FORCE_HP_CPU_NO_ISO_S  4
/** PMU_FORCE_HP_CPU_PD : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define PMU_FORCE_HP_CPU_PD    (BIT(5))
#define PMU_FORCE_HP_CPU_PD_M  (PMU_FORCE_HP_CPU_PD_V << PMU_FORCE_HP_CPU_PD_S)
#define PMU_FORCE_HP_CPU_PD_V  0x00000001U
#define PMU_FORCE_HP_CPU_PD_S  5
/** PMU_PD_HP_CPU_MASK : R/W; bitpos: [10:6]; default: 0;
 *  need_des
 */
#define PMU_PD_HP_CPU_MASK    0x0000001FU
#define PMU_PD_HP_CPU_MASK_M  (PMU_PD_HP_CPU_MASK_V << PMU_PD_HP_CPU_MASK_S)
#define PMU_PD_HP_CPU_MASK_V  0x0000001FU
#define PMU_PD_HP_CPU_MASK_S  6
/** PMU_PD_HP_CPU_PD_MASK : R/W; bitpos: [31:27]; default: 0;
 *  need_des
 */
#define PMU_PD_HP_CPU_PD_MASK    0x0000001FU
#define PMU_PD_HP_CPU_PD_MASK_M  (PMU_PD_HP_CPU_PD_MASK_V << PMU_PD_HP_CPU_PD_MASK_S)
#define PMU_PD_HP_CPU_PD_MASK_V  0x0000001FU
#define PMU_PD_HP_CPU_PD_MASK_S  27

/** PMU_POWER_PD_HPCNNT_CNTL_REG register
 *  need_des
 */
#define PMU_POWER_PD_HPCNNT_CNTL_REG (DR_REG_PMU_BASE + 0x130)
/** PMU_FORCE_HP_CNNT_RESET : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define PMU_FORCE_HP_CNNT_RESET    (BIT(0))
#define PMU_FORCE_HP_CNNT_RESET_M  (PMU_FORCE_HP_CNNT_RESET_V << PMU_FORCE_HP_CNNT_RESET_S)
#define PMU_FORCE_HP_CNNT_RESET_V  0x00000001U
#define PMU_FORCE_HP_CNNT_RESET_S  0
/** PMU_FORCE_HP_CNNT_ISO : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define PMU_FORCE_HP_CNNT_ISO    (BIT(1))
#define PMU_FORCE_HP_CNNT_ISO_M  (PMU_FORCE_HP_CNNT_ISO_V << PMU_FORCE_HP_CNNT_ISO_S)
#define PMU_FORCE_HP_CNNT_ISO_V  0x00000001U
#define PMU_FORCE_HP_CNNT_ISO_S  1
/** PMU_FORCE_HP_CNNT_PU : R/W; bitpos: [2]; default: 1;
 *  need_des
 */
#define PMU_FORCE_HP_CNNT_PU    (BIT(2))
#define PMU_FORCE_HP_CNNT_PU_M  (PMU_FORCE_HP_CNNT_PU_V << PMU_FORCE_HP_CNNT_PU_S)
#define PMU_FORCE_HP_CNNT_PU_V  0x00000001U
#define PMU_FORCE_HP_CNNT_PU_S  2
/** PMU_FORCE_HP_CNNT_NO_RESET : R/W; bitpos: [3]; default: 1;
 *  need_des
 */
#define PMU_FORCE_HP_CNNT_NO_RESET    (BIT(3))
#define PMU_FORCE_HP_CNNT_NO_RESET_M  (PMU_FORCE_HP_CNNT_NO_RESET_V << PMU_FORCE_HP_CNNT_NO_RESET_S)
#define PMU_FORCE_HP_CNNT_NO_RESET_V  0x00000001U
#define PMU_FORCE_HP_CNNT_NO_RESET_S  3
/** PMU_FORCE_HP_CNNT_NO_ISO : R/W; bitpos: [4]; default: 1;
 *  need_des
 */
#define PMU_FORCE_HP_CNNT_NO_ISO    (BIT(4))
#define PMU_FORCE_HP_CNNT_NO_ISO_M  (PMU_FORCE_HP_CNNT_NO_ISO_V << PMU_FORCE_HP_CNNT_NO_ISO_S)
#define PMU_FORCE_HP_CNNT_NO_ISO_V  0x00000001U
#define PMU_FORCE_HP_CNNT_NO_ISO_S  4
/** PMU_FORCE_HP_CNNT_PD : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define PMU_FORCE_HP_CNNT_PD    (BIT(5))
#define PMU_FORCE_HP_CNNT_PD_M  (PMU_FORCE_HP_CNNT_PD_V << PMU_FORCE_HP_CNNT_PD_S)
#define PMU_FORCE_HP_CNNT_PD_V  0x00000001U
#define PMU_FORCE_HP_CNNT_PD_S  5
/** PMU_PD_HP_CNNT_MASK : R/W; bitpos: [10:6]; default: 0;
 *  need_des
 */
#define PMU_PD_HP_CNNT_MASK    0x0000001FU
#define PMU_PD_HP_CNNT_MASK_M  (PMU_PD_HP_CNNT_MASK_V << PMU_PD_HP_CNNT_MASK_S)
#define PMU_PD_HP_CNNT_MASK_V  0x0000001FU
#define PMU_PD_HP_CNNT_MASK_S  6
/** PMU_PD_HP_CNNT_PD_MASK : R/W; bitpos: [31:27]; default: 0;
 *  need_des
 */
#define PMU_PD_HP_CNNT_PD_MASK    0x0000001FU
#define PMU_PD_HP_CNNT_PD_MASK_M  (PMU_PD_HP_CNNT_PD_MASK_V << PMU_PD_HP_CNNT_PD_MASK_S)
#define PMU_PD_HP_CNNT_PD_MASK_V  0x0000001FU
#define PMU_PD_HP_CNNT_PD_MASK_S  27

/** PMU_POWER_PD_MODEM_TOP_CNTL_REG register
 *  need_des
 */
#define PMU_POWER_PD_MODEM_TOP_CNTL_REG (DR_REG_PMU_BASE + 0x134)
/** PMU_FORCE_MODEM_TOP_RESET : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define PMU_FORCE_MODEM_TOP_RESET    (BIT(0))
#define PMU_FORCE_MODEM_TOP_RESET_M  (PMU_FORCE_MODEM_TOP_RESET_V << PMU_FORCE_MODEM_TOP_RESET_S)
#define PMU_FORCE_MODEM_TOP_RESET_V  0x00000001U
#define PMU_FORCE_MODEM_TOP_RESET_S  0
/** PMU_FORCE_MODEM_TOP_ISO : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define PMU_FORCE_MODEM_TOP_ISO    (BIT(1))
#define PMU_FORCE_MODEM_TOP_ISO_M  (PMU_FORCE_MODEM_TOP_ISO_V << PMU_FORCE_MODEM_TOP_ISO_S)
#define PMU_FORCE_MODEM_TOP_ISO_V  0x00000001U
#define PMU_FORCE_MODEM_TOP_ISO_S  1
/** PMU_FORCE_MODEM_TOP_PU : R/W; bitpos: [2]; default: 1;
 *  need_des
 */
#define PMU_FORCE_MODEM_TOP_PU    (BIT(2))
#define PMU_FORCE_MODEM_TOP_PU_M  (PMU_FORCE_MODEM_TOP_PU_V << PMU_FORCE_MODEM_TOP_PU_S)
#define PMU_FORCE_MODEM_TOP_PU_V  0x00000001U
#define PMU_FORCE_MODEM_TOP_PU_S  2
/** PMU_FORCE_MODEM_TOP_NO_RESET : R/W; bitpos: [3]; default: 1;
 *  need_des
 */
#define PMU_FORCE_MODEM_TOP_NO_RESET    (BIT(3))
#define PMU_FORCE_MODEM_TOP_NO_RESET_M  (PMU_FORCE_MODEM_TOP_NO_RESET_V << PMU_FORCE_MODEM_TOP_NO_RESET_S)
#define PMU_FORCE_MODEM_TOP_NO_RESET_V  0x00000001U
#define PMU_FORCE_MODEM_TOP_NO_RESET_S  3
/** PMU_FORCE_MODEM_TOP_NO_ISO : R/W; bitpos: [4]; default: 1;
 *  need_des
 */
#define PMU_FORCE_MODEM_TOP_NO_ISO    (BIT(4))
#define PMU_FORCE_MODEM_TOP_NO_ISO_M  (PMU_FORCE_MODEM_TOP_NO_ISO_V << PMU_FORCE_MODEM_TOP_NO_ISO_S)
#define PMU_FORCE_MODEM_TOP_NO_ISO_V  0x00000001U
#define PMU_FORCE_MODEM_TOP_NO_ISO_S  4
/** PMU_FORCE_MODEM_TOP_PD : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define PMU_FORCE_MODEM_TOP_PD    (BIT(5))
#define PMU_FORCE_MODEM_TOP_PD_M  (PMU_FORCE_MODEM_TOP_PD_V << PMU_FORCE_MODEM_TOP_PD_S)
#define PMU_FORCE_MODEM_TOP_PD_V  0x00000001U
#define PMU_FORCE_MODEM_TOP_PD_S  5
/** PMU_PD_MODEM_TOP_MASK : R/W; bitpos: [10:6]; default: 0;
 *  need_des
 */
#define PMU_PD_MODEM_TOP_MASK    0x0000001FU
#define PMU_PD_MODEM_TOP_MASK_M  (PMU_PD_MODEM_TOP_MASK_V << PMU_PD_MODEM_TOP_MASK_S)
#define PMU_PD_MODEM_TOP_MASK_V  0x0000001FU
#define PMU_PD_MODEM_TOP_MASK_S  6
/** PMU_PD_MODEM_TOP_PD_MASK : R/W; bitpos: [31:27]; default: 0;
 *  need_des
 */
#define PMU_PD_MODEM_TOP_PD_MASK    0x0000001FU
#define PMU_PD_MODEM_TOP_PD_MASK_M  (PMU_PD_MODEM_TOP_PD_MASK_V << PMU_PD_MODEM_TOP_PD_MASK_S)
#define PMU_PD_MODEM_TOP_PD_MASK_V  0x0000001FU
#define PMU_PD_MODEM_TOP_PD_MASK_S  27

/** PMU_POWER_PD_LPPERI_CNTL_REG register
 *  need_des
 */
#define PMU_POWER_PD_LPPERI_CNTL_REG (DR_REG_PMU_BASE + 0x138)
/** PMU_FORCE_LP_PERI_RESET : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define PMU_FORCE_LP_PERI_RESET    (BIT(0))
#define PMU_FORCE_LP_PERI_RESET_M  (PMU_FORCE_LP_PERI_RESET_V << PMU_FORCE_LP_PERI_RESET_S)
#define PMU_FORCE_LP_PERI_RESET_V  0x00000001U
#define PMU_FORCE_LP_PERI_RESET_S  0
/** PMU_FORCE_LP_PERI_ISO : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define PMU_FORCE_LP_PERI_ISO    (BIT(1))
#define PMU_FORCE_LP_PERI_ISO_M  (PMU_FORCE_LP_PERI_ISO_V << PMU_FORCE_LP_PERI_ISO_S)
#define PMU_FORCE_LP_PERI_ISO_V  0x00000001U
#define PMU_FORCE_LP_PERI_ISO_S  1
/** PMU_FORCE_LP_PERI_PU : R/W; bitpos: [2]; default: 1;
 *  need_des
 */
#define PMU_FORCE_LP_PERI_PU    (BIT(2))
#define PMU_FORCE_LP_PERI_PU_M  (PMU_FORCE_LP_PERI_PU_V << PMU_FORCE_LP_PERI_PU_S)
#define PMU_FORCE_LP_PERI_PU_V  0x00000001U
#define PMU_FORCE_LP_PERI_PU_S  2
/** PMU_FORCE_LP_PERI_NO_RESET : R/W; bitpos: [3]; default: 1;
 *  need_des
 */
#define PMU_FORCE_LP_PERI_NO_RESET    (BIT(3))
#define PMU_FORCE_LP_PERI_NO_RESET_M  (PMU_FORCE_LP_PERI_NO_RESET_V << PMU_FORCE_LP_PERI_NO_RESET_S)
#define PMU_FORCE_LP_PERI_NO_RESET_V  0x00000001U
#define PMU_FORCE_LP_PERI_NO_RESET_S  3
/** PMU_FORCE_LP_PERI_NO_ISO : R/W; bitpos: [4]; default: 1;
 *  need_des
 */
#define PMU_FORCE_LP_PERI_NO_ISO    (BIT(4))
#define PMU_FORCE_LP_PERI_NO_ISO_M  (PMU_FORCE_LP_PERI_NO_ISO_V << PMU_FORCE_LP_PERI_NO_ISO_S)
#define PMU_FORCE_LP_PERI_NO_ISO_V  0x00000001U
#define PMU_FORCE_LP_PERI_NO_ISO_S  4
/** PMU_FORCE_LP_PERI_PD : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define PMU_FORCE_LP_PERI_PD    (BIT(5))
#define PMU_FORCE_LP_PERI_PD_M  (PMU_FORCE_LP_PERI_PD_V << PMU_FORCE_LP_PERI_PD_S)
#define PMU_FORCE_LP_PERI_PD_V  0x00000001U
#define PMU_FORCE_LP_PERI_PD_S  5

/** PMU_POWER_PD_MEM_CNTL_REG register
 *  need_des
 */
#define PMU_POWER_PD_MEM_CNTL_REG (DR_REG_PMU_BASE + 0x13c)
/** PMU_FORCE_HP_MEM_ISO : R/W; bitpos: [3:0]; default: 0;
 *  need_des
 */
#define PMU_FORCE_HP_MEM_ISO    0x0000000FU
#define PMU_FORCE_HP_MEM_ISO_M  (PMU_FORCE_HP_MEM_ISO_V << PMU_FORCE_HP_MEM_ISO_S)
#define PMU_FORCE_HP_MEM_ISO_V  0x0000000FU
#define PMU_FORCE_HP_MEM_ISO_S  0
/** PMU_FORCE_HP_MEM_PD : R/W; bitpos: [7:4]; default: 0;
 *  need_des
 */
#define PMU_FORCE_HP_MEM_PD    0x0000000FU
#define PMU_FORCE_HP_MEM_PD_M  (PMU_FORCE_HP_MEM_PD_V << PMU_FORCE_HP_MEM_PD_S)
#define PMU_FORCE_HP_MEM_PD_V  0x0000000FU
#define PMU_FORCE_HP_MEM_PD_S  4
/** PMU_FORCE_HP_MEM_NO_ISO : R/W; bitpos: [27:24]; default: 15;
 *  need_des
 */
#define PMU_FORCE_HP_MEM_NO_ISO    0x0000000FU
#define PMU_FORCE_HP_MEM_NO_ISO_M  (PMU_FORCE_HP_MEM_NO_ISO_V << PMU_FORCE_HP_MEM_NO_ISO_S)
#define PMU_FORCE_HP_MEM_NO_ISO_V  0x0000000FU
#define PMU_FORCE_HP_MEM_NO_ISO_S  24
/** PMU_FORCE_HP_MEM_PU : R/W; bitpos: [31:28]; default: 15;
 *  need_des
 */
#define PMU_FORCE_HP_MEM_PU    0x0000000FU
#define PMU_FORCE_HP_MEM_PU_M  (PMU_FORCE_HP_MEM_PU_V << PMU_FORCE_HP_MEM_PU_S)
#define PMU_FORCE_HP_MEM_PU_V  0x0000000FU
#define PMU_FORCE_HP_MEM_PU_S  28

/** PMU_POWER_PD_MEM_MASK_REG register
 *  need_des
 */
#define PMU_POWER_PD_MEM_MASK_REG (DR_REG_PMU_BASE + 0x140)
/** PMU_PD_HP_MEM2_PD_MASK : R/W; bitpos: [4:0]; default: 0;
 *  need_des
 */
#define PMU_PD_HP_MEM2_PD_MASK    0x0000001FU
#define PMU_PD_HP_MEM2_PD_MASK_M  (PMU_PD_HP_MEM2_PD_MASK_V << PMU_PD_HP_MEM2_PD_MASK_S)
#define PMU_PD_HP_MEM2_PD_MASK_V  0x0000001FU
#define PMU_PD_HP_MEM2_PD_MASK_S  0
/** PMU_PD_HP_MEM1_PD_MASK : R/W; bitpos: [9:5]; default: 0;
 *  need_des
 */
#define PMU_PD_HP_MEM1_PD_MASK    0x0000001FU
#define PMU_PD_HP_MEM1_PD_MASK_M  (PMU_PD_HP_MEM1_PD_MASK_V << PMU_PD_HP_MEM1_PD_MASK_S)
#define PMU_PD_HP_MEM1_PD_MASK_V  0x0000001FU
#define PMU_PD_HP_MEM1_PD_MASK_S  5
/** PMU_PD_HP_MEM0_PD_MASK : R/W; bitpos: [14:10]; default: 0;
 *  need_des
 */
#define PMU_PD_HP_MEM0_PD_MASK    0x0000001FU
#define PMU_PD_HP_MEM0_PD_MASK_M  (PMU_PD_HP_MEM0_PD_MASK_V << PMU_PD_HP_MEM0_PD_MASK_S)
#define PMU_PD_HP_MEM0_PD_MASK_V  0x0000001FU
#define PMU_PD_HP_MEM0_PD_MASK_S  10
/** PMU_PD_HP_MEM2_MASK : R/W; bitpos: [21:17]; default: 0;
 *  need_des
 */
#define PMU_PD_HP_MEM2_MASK    0x0000001FU
#define PMU_PD_HP_MEM2_MASK_M  (PMU_PD_HP_MEM2_MASK_V << PMU_PD_HP_MEM2_MASK_S)
#define PMU_PD_HP_MEM2_MASK_V  0x0000001FU
#define PMU_PD_HP_MEM2_MASK_S  17
/** PMU_PD_HP_MEM1_MASK : R/W; bitpos: [26:22]; default: 0;
 *  need_des
 */
#define PMU_PD_HP_MEM1_MASK    0x0000001FU
#define PMU_PD_HP_MEM1_MASK_M  (PMU_PD_HP_MEM1_MASK_V << PMU_PD_HP_MEM1_MASK_S)
#define PMU_PD_HP_MEM1_MASK_V  0x0000001FU
#define PMU_PD_HP_MEM1_MASK_S  22
/** PMU_PD_HP_MEM0_MASK : R/W; bitpos: [31:27]; default: 0;
 *  need_des
 */
#define PMU_PD_HP_MEM0_MASK    0x0000001FU
#define PMU_PD_HP_MEM0_MASK_M  (PMU_PD_HP_MEM0_MASK_V << PMU_PD_HP_MEM0_MASK_S)
#define PMU_PD_HP_MEM0_MASK_V  0x0000001FU
#define PMU_PD_HP_MEM0_MASK_S  27

/** PMU_POWER_HP_PAD_REG register
 *  need_des
 */
#define PMU_POWER_HP_PAD_REG (DR_REG_PMU_BASE + 0x144)
/** PMU_FORCE_HP_PAD_NO_ISO_ALL : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define PMU_FORCE_HP_PAD_NO_ISO_ALL    (BIT(0))
#define PMU_FORCE_HP_PAD_NO_ISO_ALL_M  (PMU_FORCE_HP_PAD_NO_ISO_ALL_V << PMU_FORCE_HP_PAD_NO_ISO_ALL_S)
#define PMU_FORCE_HP_PAD_NO_ISO_ALL_V  0x00000001U
#define PMU_FORCE_HP_PAD_NO_ISO_ALL_S  0
/** PMU_FORCE_HP_PAD_ISO_ALL : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define PMU_FORCE_HP_PAD_ISO_ALL    (BIT(1))
#define PMU_FORCE_HP_PAD_ISO_ALL_M  (PMU_FORCE_HP_PAD_ISO_ALL_V << PMU_FORCE_HP_PAD_ISO_ALL_S)
#define PMU_FORCE_HP_PAD_ISO_ALL_V  0x00000001U
#define PMU_FORCE_HP_PAD_ISO_ALL_S  1

/** PMU_POWER_VDD_SPI_CNTL_REG register
 *  need_des
 */
#define PMU_POWER_VDD_SPI_CNTL_REG (DR_REG_PMU_BASE + 0x148)
/** PMU_VDD_SPI_PWR_WAIT : R/W; bitpos: [28:18]; default: 255;
 *  need_des
 */
#define PMU_VDD_SPI_PWR_WAIT    0x000007FFU
#define PMU_VDD_SPI_PWR_WAIT_M  (PMU_VDD_SPI_PWR_WAIT_V << PMU_VDD_SPI_PWR_WAIT_S)
#define PMU_VDD_SPI_PWR_WAIT_V  0x000007FFU
#define PMU_VDD_SPI_PWR_WAIT_S  18
/** PMU_VDD_SPI_PWR_SW : R/W; bitpos: [30:29]; default: 3;
 *  need_des
 */
#define PMU_VDD_SPI_PWR_SW    0x00000003U
#define PMU_VDD_SPI_PWR_SW_M  (PMU_VDD_SPI_PWR_SW_V << PMU_VDD_SPI_PWR_SW_S)
#define PMU_VDD_SPI_PWR_SW_V  0x00000003U
#define PMU_VDD_SPI_PWR_SW_S  29
/** PMU_VDD_SPI_PWR_SEL_SW : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_VDD_SPI_PWR_SEL_SW    (BIT(31))
#define PMU_VDD_SPI_PWR_SEL_SW_M  (PMU_VDD_SPI_PWR_SEL_SW_V << PMU_VDD_SPI_PWR_SEL_SW_S)
#define PMU_VDD_SPI_PWR_SEL_SW_V  0x00000001U
#define PMU_VDD_SPI_PWR_SEL_SW_S  31

/** PMU_POWER_CK_WAIT_CNTL_REG register
 *  need_des
 */
#define PMU_POWER_CK_WAIT_CNTL_REG (DR_REG_PMU_BASE + 0x14c)
/** PMU_PMU_WAIT_XTL_STABLE : R/W; bitpos: [15:0]; default: 256;
 *  need_des
 */
#define PMU_PMU_WAIT_XTL_STABLE    0x0000FFFFU
#define PMU_PMU_WAIT_XTL_STABLE_M  (PMU_PMU_WAIT_XTL_STABLE_V << PMU_PMU_WAIT_XTL_STABLE_S)
#define PMU_PMU_WAIT_XTL_STABLE_V  0x0000FFFFU
#define PMU_PMU_WAIT_XTL_STABLE_S  0
/** PMU_PMU_WAIT_PLL_STABLE : R/W; bitpos: [31:16]; default: 256;
 *  need_des
 */
#define PMU_PMU_WAIT_PLL_STABLE    0x0000FFFFU
#define PMU_PMU_WAIT_PLL_STABLE_M  (PMU_PMU_WAIT_PLL_STABLE_V << PMU_PMU_WAIT_PLL_STABLE_S)
#define PMU_PMU_WAIT_PLL_STABLE_V  0x0000FFFFU
#define PMU_PMU_WAIT_PLL_STABLE_S  16

