espressif/esp-idf/components/soc/esp32s31/register/soc/pmu_reg.h
/** PMU_CLK_STATE2_REG register
 *  need_des
 */
#define PMU_CLK_STATE2_REG (DR_REG_PMU_BASE + 0x1d0)
/** PMU_PMU_ICG_APB_EN_STATE : RO; bitpos: [31:0]; default: 4294967295;
 *  need_des
 */
#define PMU_PMU_ICG_APB_EN_STATE    0xFFFFFFFFU
#define PMU_PMU_ICG_APB_EN_STATE_M  (PMU_PMU_ICG_APB_EN_STATE_V << PMU_PMU_ICG_APB_EN_STATE_S)
#define PMU_PMU_ICG_APB_EN_STATE_V  0xFFFFFFFFU
#define PMU_PMU_ICG_APB_EN_STATE_S  0

/** PMU_CLK_STATE3_REG register
 *  need_des
 */
#define PMU_CLK_STATE3_REG (DR_REG_PMU_BASE + 0x1d4)
/** PMU_STABLE_XPD_PLL_STATE : RO; bitpos: [19:16]; default: 15;
 *  need_des
 */
#define PMU_STABLE_XPD_PLL_STATE    0x0000000FU
#define PMU_STABLE_XPD_PLL_STATE_M  (PMU_STABLE_XPD_PLL_STATE_V << PMU_STABLE_XPD_PLL_STATE_S)
#define PMU_STABLE_XPD_PLL_STATE_V  0x0000000FU
#define PMU_STABLE_XPD_PLL_STATE_S  16
/** PMU_PMU_ICG_GLOBAL_PLL_STATE : RO; bitpos: [23:20]; default: 15;
 *  need_des
 */
#define PMU_PMU_ICG_GLOBAL_PLL_STATE    0x0000000FU
#define PMU_PMU_ICG_GLOBAL_PLL_STATE_M  (PMU_PMU_ICG_GLOBAL_PLL_STATE_V << PMU_PMU_ICG_GLOBAL_PLL_STATE_S)
#define PMU_PMU_ICG_GLOBAL_PLL_STATE_V  0x0000000FU
#define PMU_PMU_ICG_GLOBAL_PLL_STATE_S  20
/** PMU_PMU_ANA_XPD_PLL_I2C_STATE : RO; bitpos: [27:24]; default: 15;
 *  need_des
 */
#define PMU_PMU_ANA_XPD_PLL_I2C_STATE    0x0000000FU
#define PMU_PMU_ANA_XPD_PLL_I2C_STATE_M  (PMU_PMU_ANA_XPD_PLL_I2C_STATE_V << PMU_PMU_ANA_XPD_PLL_I2C_STATE_S)
#define PMU_PMU_ANA_XPD_PLL_I2C_STATE_V  0x0000000FU
#define PMU_PMU_ANA_XPD_PLL_I2C_STATE_S  24
/** PMU_PMU_ANA_XPD_PLL_STATE : RO; bitpos: [31:28]; default: 15;
 *  need_des
 */
#define PMU_PMU_ANA_XPD_PLL_STATE    0x0000000FU
#define PMU_PMU_ANA_XPD_PLL_STATE_M  (PMU_PMU_ANA_XPD_PLL_STATE_V << PMU_PMU_ANA_XPD_PLL_STATE_S)
#define PMU_PMU_ANA_XPD_PLL_STATE_V  0x0000000FU
#define PMU_PMU_ANA_XPD_PLL_STATE_S  28

/** PMU_VDD_SPI_STATUS_REG register
 *  need_des
 */
#define PMU_VDD_SPI_STATUS_REG (DR_REG_PMU_BASE + 0x1d8)
/** PMU_FLASH_POWER_READY : RO; bitpos: [29]; default: 0;
 *  need_des
 */
#define PMU_FLASH_POWER_READY    (BIT(29))
#define PMU_FLASH_POWER_READY_M  (PMU_FLASH_POWER_READY_V << PMU_FLASH_POWER_READY_S)
#define PMU_FLASH_POWER_READY_V  0x00000001U
#define PMU_FLASH_POWER_READY_S  29
/** PMU_FLASH_POWER_SEL_DONE : RO; bitpos: [30]; default: 0;
 *  need_des
 */
#define PMU_FLASH_POWER_SEL_DONE    (BIT(30))
#define PMU_FLASH_POWER_SEL_DONE_M  (PMU_FLASH_POWER_SEL_DONE_V << PMU_FLASH_POWER_SEL_DONE_S)
#define PMU_FLASH_POWER_SEL_DONE_V  0x00000001U
#define PMU_FLASH_POWER_SEL_DONE_S  30
/** PMU_STABLE_VDD_SPI_PWR_DRV : RO; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_STABLE_VDD_SPI_PWR_DRV    (BIT(31))
#define PMU_STABLE_VDD_SPI_PWR_DRV_M  (PMU_STABLE_VDD_SPI_PWR_DRV_V << PMU_STABLE_VDD_SPI_PWR_DRV_S)
#define PMU_STABLE_VDD_SPI_PWR_DRV_V  0x00000001U
#define PMU_STABLE_VDD_SPI_PWR_DRV_S  31

/** PMU_VDD_SPI_CFG_REG register
 *  need_des
 */
#define PMU_VDD_SPI_CFG_REG (DR_REG_PMU_BASE + 0x1dc)
/** PMU_FLASH_SW_POWER_SEL : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define PMU_FLASH_SW_POWER_SEL    (BIT(0))
#define PMU_FLASH_SW_POWER_SEL_M  (PMU_FLASH_SW_POWER_SEL_V << PMU_FLASH_SW_POWER_SEL_S)
#define PMU_FLASH_SW_POWER_SEL_V  0x00000001U
#define PMU_FLASH_SW_POWER_SEL_S  0
/** PMU_FLASH_POWER_SEL_SW_CTRL : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define PMU_FLASH_POWER_SEL_SW_CTRL    (BIT(1))
#define PMU_FLASH_POWER_SEL_SW_CTRL_M  (PMU_FLASH_POWER_SEL_SW_CTRL_V << PMU_FLASH_POWER_SEL_SW_CTRL_S)
#define PMU_FLASH_POWER_SEL_SW_CTRL_V  0x00000001U
#define PMU_FLASH_POWER_SEL_SW_CTRL_S  1
/** PMU_FLASH_SWITCH_TIME : R/W; bitpos: [11:2]; default: 300;
 *  need_des
 */
#define PMU_FLASH_SWITCH_TIME    0x000003FFU
#define PMU_FLASH_SWITCH_TIME_M  (PMU_FLASH_SWITCH_TIME_V << PMU_FLASH_SWITCH_TIME_S)
#define PMU_FLASH_SWITCH_TIME_V  0x000003FFU
#define PMU_FLASH_SWITCH_TIME_S  2
/** PMU_FLASH_STABLE_TIME : R/W; bitpos: [21:12]; default: 128;
 *  need_des
 */
#define PMU_FLASH_STABLE_TIME    0x000003FFU
#define PMU_FLASH_STABLE_TIME_M  (PMU_FLASH_STABLE_TIME_V << PMU_FLASH_STABLE_TIME_S)
#define PMU_FLASH_STABLE_TIME_V  0x000003FFU
#define PMU_FLASH_STABLE_TIME_S  12
/** PMU_FLASH_COOLDOWN_TIME : R/W; bitpos: [31:22]; default: 10;
 *  need_des
 */
#define PMU_FLASH_COOLDOWN_TIME    0x000003FFU
#define PMU_FLASH_COOLDOWN_TIME_M  (PMU_FLASH_COOLDOWN_TIME_V << PMU_FLASH_COOLDOWN_TIME_S)
#define PMU_FLASH_COOLDOWN_TIME_V  0x000003FFU
#define PMU_FLASH_COOLDOWN_TIME_S  22

/** PMU_VDD_SPI_DISCHARGE_CFG_REG register
 *  need_des
 */
#define PMU_VDD_SPI_DISCHARGE_CFG_REG (DR_REG_PMU_BASE + 0x1e0)
/** PMU_FLASH_DISCHARGE_TIME : R/W; bitpos: [9:0]; default: 8;
 *  need_des
 */
#define PMU_FLASH_DISCHARGE_TIME    0x000003FFU
#define PMU_FLASH_DISCHARGE_TIME_M  (PMU_FLASH_DISCHARGE_TIME_V << PMU_FLASH_DISCHARGE_TIME_S)
#define PMU_FLASH_DISCHARGE_TIME_V  0x000003FFU
#define PMU_FLASH_DISCHARGE_TIME_S  0

/** PMU_VDD_SDIO_CFG_REG register
 *  need_des
 */
#define PMU_VDD_SDIO_CFG_REG (DR_REG_PMU_BASE + 0x1e4)
/** PMU_SDIO_SW_POWER_SEL : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define PMU_SDIO_SW_POWER_SEL    (BIT(0))
#define PMU_SDIO_SW_POWER_SEL_M  (PMU_SDIO_SW_POWER_SEL_V << PMU_SDIO_SW_POWER_SEL_S)
#define PMU_SDIO_SW_POWER_SEL_V  0x00000001U
#define PMU_SDIO_SW_POWER_SEL_S  0
/** PMU_SDIO_POWER_SEL_SW_CTRL : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define PMU_SDIO_POWER_SEL_SW_CTRL    (BIT(1))
#define PMU_SDIO_POWER_SEL_SW_CTRL_M  (PMU_SDIO_POWER_SEL_SW_CTRL_V << PMU_SDIO_POWER_SEL_SW_CTRL_S)
#define PMU_SDIO_POWER_SEL_SW_CTRL_V  0x00000001U
#define PMU_SDIO_POWER_SEL_SW_CTRL_S  1
/** PMU_SDIO_SWITCH_TIME : R/W; bitpos: [11:2]; default: 10;
 *  need_des
 */
#define PMU_SDIO_SWITCH_TIME    0x000003FFU
#define PMU_SDIO_SWITCH_TIME_M  (PMU_SDIO_SWITCH_TIME_V << PMU_SDIO_SWITCH_TIME_S)
#define PMU_SDIO_SWITCH_TIME_V  0x000003FFU
#define PMU_SDIO_SWITCH_TIME_S  2

/** PMU_PSRAM_CFG_REG register
 *  need_des
 */
#define PMU_PSRAM_CFG_REG (DR_REG_PMU_BASE + 0x1e8)
/** PMU_PSRAM_XPD : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_PSRAM_XPD    (BIT(31))
#define PMU_PSRAM_XPD_M  (PMU_PSRAM_XPD_V << PMU_PSRAM_XPD_S)
#define PMU_PSRAM_XPD_V  0x00000001U
#define PMU_PSRAM_XPD_S  31

/** PMU_CPU_STALL_SW_REG register
 *  need_des
 */
#define PMU_CPU_STALL_SW_REG (DR_REG_PMU_BASE + 0x1ec)
/** PMU_HPCORE1_SW_STALL_CODE : R/W; bitpos: [23:16]; default: 0;
 *  need_des
 */
#define PMU_HPCORE1_SW_STALL_CODE    0x000000FFU
#define PMU_HPCORE1_SW_STALL_CODE_M  (PMU_HPCORE1_SW_STALL_CODE_V << PMU_HPCORE1_SW_STALL_CODE_S)
#define PMU_HPCORE1_SW_STALL_CODE_V  0x000000FFU
#define PMU_HPCORE1_SW_STALL_CODE_S  16
/** PMU_HPCORE0_SW_STALL_CODE : R/W; bitpos: [31:24]; default: 0;
 *  need_des
 */
#define PMU_HPCORE0_SW_STALL_CODE    0x000000FFU
#define PMU_HPCORE0_SW_STALL_CODE_M  (PMU_HPCORE0_SW_STALL_CODE_V << PMU_HPCORE0_SW_STALL_CODE_S)
#define PMU_HPCORE0_SW_STALL_CODE_V  0x000000FFU
#define PMU_HPCORE0_SW_STALL_CODE_S  24

/** PMU_EXT_WAKEUP_LV_REG register
 *  need_des
 */
#define PMU_EXT_WAKEUP_LV_REG (DR_REG_PMU_BASE + 0x1f0)
/** PMU_EXT_WAKEUP_LV : R/W; bitpos: [20:0]; default: 0;
 *  need_des
 */
#define PMU_EXT_WAKEUP_LV    0x001FFFFFU
#define PMU_EXT_WAKEUP_LV_M  (PMU_EXT_WAKEUP_LV_V << PMU_EXT_WAKEUP_LV_S)
#define PMU_EXT_WAKEUP_LV_V  0x001FFFFFU
#define PMU_EXT_WAKEUP_LV_S  0

