espressif/esp-idf/components/soc/esp32s31/register/soc/pmu_reg.h
/** PMU_EXT_WAKEUP_SEL_REG register
 *  need_des
 */
#define PMU_EXT_WAKEUP_SEL_REG (DR_REG_PMU_BASE + 0x1f4)
/** PMU_EXT_WAKEUP_SEL : R/W; bitpos: [20:0]; default: 0;
 *  need_des
 */
#define PMU_EXT_WAKEUP_SEL    0x001FFFFFU
#define PMU_EXT_WAKEUP_SEL_M  (PMU_EXT_WAKEUP_SEL_V << PMU_EXT_WAKEUP_SEL_S)
#define PMU_EXT_WAKEUP_SEL_V  0x001FFFFFU
#define PMU_EXT_WAKEUP_SEL_S  0

/** PMU_EXT_WAKEUP_ST_REG register
 *  need_des
 */
#define PMU_EXT_WAKEUP_ST_REG (DR_REG_PMU_BASE + 0x1f8)
/** PMU_EXT_WAKEUP_STATUS : RO; bitpos: [20:0]; default: 0;
 *  need_des
 */
#define PMU_EXT_WAKEUP_STATUS    0x001FFFFFU
#define PMU_EXT_WAKEUP_STATUS_M  (PMU_EXT_WAKEUP_STATUS_V << PMU_EXT_WAKEUP_STATUS_S)
#define PMU_EXT_WAKEUP_STATUS_V  0x001FFFFFU
#define PMU_EXT_WAKEUP_STATUS_S  0

/** PMU_EXT_WAKEUP_CNTL_REG register
 *  need_des
 */
#define PMU_EXT_WAKEUP_CNTL_REG (DR_REG_PMU_BASE + 0x1fc)
/** PMU_EXT_WAKEUP_STATUS_CLR : R/W; bitpos: [30]; default: 0;
 *  need_des
 */
#define PMU_EXT_WAKEUP_STATUS_CLR    (BIT(30))
#define PMU_EXT_WAKEUP_STATUS_CLR_M  (PMU_EXT_WAKEUP_STATUS_CLR_V << PMU_EXT_WAKEUP_STATUS_CLR_S)
#define PMU_EXT_WAKEUP_STATUS_CLR_V  0x00000001U
#define PMU_EXT_WAKEUP_STATUS_CLR_S  30
/** PMU_EXT_WAKEUP_FILTER : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_EXT_WAKEUP_FILTER    (BIT(31))
#define PMU_EXT_WAKEUP_FILTER_M  (PMU_EXT_WAKEUP_FILTER_V << PMU_EXT_WAKEUP_FILTER_S)
#define PMU_EXT_WAKEUP_FILTER_V  0x00000001U
#define PMU_EXT_WAKEUP_FILTER_S  31

/** PMU_SDIO_WAKEUP_CNTL_REG register
 *  control the wait timer register for sdio wakeup control
 */
#define PMU_SDIO_WAKEUP_CNTL_REG (DR_REG_PMU_BASE + 0x200)
/** PMU_SDIO_ACT_DNUM : R/W; bitpos: [9:0]; default: 1023;
 *  delay number config for sdio wakeup control
 */
#define PMU_SDIO_ACT_DNUM    0x000003FFU
#define PMU_SDIO_ACT_DNUM_M  (PMU_SDIO_ACT_DNUM_V << PMU_SDIO_ACT_DNUM_S)
#define PMU_SDIO_ACT_DNUM_V  0x000003FFU
#define PMU_SDIO_ACT_DNUM_S  0

/** PMU_TOUCH_PWR_CTRL_REG register
 *  need_des
 */
#define PMU_TOUCH_PWR_CTRL_REG (DR_REG_PMU_BASE + 0x204)
/** PMU_TOUCH_SLEEP_CYCLES : R/W; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define PMU_TOUCH_SLEEP_CYCLES    0x0000FFFFU
#define PMU_TOUCH_SLEEP_CYCLES_M  (PMU_TOUCH_SLEEP_CYCLES_V << PMU_TOUCH_SLEEP_CYCLES_S)
#define PMU_TOUCH_SLEEP_CYCLES_V  0x0000FFFFU
#define PMU_TOUCH_SLEEP_CYCLES_S  0
/** PMU_TOUCH_WAIT_CYCLES : R/W; bitpos: [29:21]; default: 0;
 *  need_des
 */
#define PMU_TOUCH_WAIT_CYCLES    0x000001FFU
#define PMU_TOUCH_WAIT_CYCLES_M  (PMU_TOUCH_WAIT_CYCLES_V << PMU_TOUCH_WAIT_CYCLES_S)
#define PMU_TOUCH_WAIT_CYCLES_V  0x000001FFU
#define PMU_TOUCH_WAIT_CYCLES_S  21
/** PMU_TOUCH_SLEEP_TIMER_EN : R/W; bitpos: [30]; default: 0;
 *  need_des
 */
#define PMU_TOUCH_SLEEP_TIMER_EN    (BIT(30))
#define PMU_TOUCH_SLEEP_TIMER_EN_M  (PMU_TOUCH_SLEEP_TIMER_EN_V << PMU_TOUCH_SLEEP_TIMER_EN_S)
#define PMU_TOUCH_SLEEP_TIMER_EN_V  0x00000001U
#define PMU_TOUCH_SLEEP_TIMER_EN_S  30
/** PMU_TOUCH_FORCE_DONE : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_TOUCH_FORCE_DONE    (BIT(31))
#define PMU_TOUCH_FORCE_DONE_M  (PMU_TOUCH_FORCE_DONE_V << PMU_TOUCH_FORCE_DONE_S)
#define PMU_TOUCH_FORCE_DONE_V  0x00000001U
#define PMU_TOUCH_FORCE_DONE_S  31

/** PMU_ANA_PERI_PWR_CTRL_REG register
 *  need_des
 */
#define PMU_ANA_PERI_PWR_CTRL_REG (DR_REG_PMU_BASE + 0x208)
/** PMU_XPD_PERIF_I2C : R/W; bitpos: [30]; default: 1;
 *  need_des
 */
#define PMU_XPD_PERIF_I2C    (BIT(30))
#define PMU_XPD_PERIF_I2C_M  (PMU_XPD_PERIF_I2C_V << PMU_XPD_PERIF_I2C_S)
#define PMU_XPD_PERIF_I2C_V  0x00000001U
#define PMU_XPD_PERIF_I2C_S  30
/** PMU_RSTB_PERIF_I2C : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_RSTB_PERIF_I2C    (BIT(31))
#define PMU_RSTB_PERIF_I2C_M  (PMU_RSTB_PERIF_I2C_V << PMU_RSTB_PERIF_I2C_S)
#define PMU_RSTB_PERIF_I2C_V  0x00000001U
#define PMU_RSTB_PERIF_I2C_S  31

/** PMU_RDN_ECO_REG register
 *  used for future potential eco, others don't care
 */
#define PMU_RDN_ECO_REG (DR_REG_PMU_BASE + 0x20c)
/** PMU_PMU_RDN_ECO_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_PMU_RDN_ECO_EN    (BIT(31))
#define PMU_PMU_RDN_ECO_EN_M  (PMU_PMU_RDN_ECO_EN_V << PMU_PMU_RDN_ECO_EN_S)
#define PMU_PMU_RDN_ECO_EN_V  0x00000001U
#define PMU_PMU_RDN_ECO_EN_S  31

/** PMU_PUF_MEM_CTRL_REG register
 *  used for future potential eco, others don't care
 */
#define PMU_PUF_MEM_CTRL_REG (DR_REG_PMU_BASE + 0x210)
/** PMU_PUF_MEM_PSW : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define PMU_PUF_MEM_PSW    (BIT(0))
#define PMU_PUF_MEM_PSW_M  (PMU_PUF_MEM_PSW_V << PMU_PUF_MEM_PSW_S)
#define PMU_PUF_MEM_PSW_V  0x00000001U
#define PMU_PUF_MEM_PSW_S  0
/** PMU_PUF_MEM_ISO : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define PMU_PUF_MEM_ISO    (BIT(1))
#define PMU_PUF_MEM_ISO_M  (PMU_PUF_MEM_ISO_V << PMU_PUF_MEM_ISO_S)
#define PMU_PUF_MEM_ISO_V  0x00000001U
#define PMU_PUF_MEM_ISO_S  1
/** PMU_PUF_MEM_DISCHARGE : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define PMU_PUF_MEM_DISCHARGE    (BIT(2))
#define PMU_PUF_MEM_DISCHARGE_M  (PMU_PUF_MEM_DISCHARGE_V << PMU_PUF_MEM_DISCHARGE_S)
#define PMU_PUF_MEM_DISCHARGE_V  0x00000001U
#define PMU_PUF_MEM_DISCHARGE_S  2

/** PMU_SLP_WAKEUP_CNTL8_REG register
 *  need_des
 */
#define PMU_SLP_WAKEUP_CNTL8_REG (DR_REG_PMU_BASE + 0x214)
/** PMU_PD_TOP_PU_DELT_TIMER : R/W; bitpos: [2:0]; default: 0;
 *  need_des
 */
#define PMU_PD_TOP_PU_DELT_TIMER    0x00000007U
#define PMU_PD_TOP_PU_DELT_TIMER_M  (PMU_PD_TOP_PU_DELT_TIMER_V << PMU_PD_TOP_PU_DELT_TIMER_S)
#define PMU_PD_TOP_PU_DELT_TIMER_V  0x00000007U
#define PMU_PD_TOP_PU_DELT_TIMER_S  0
/** PMU_PD_HP_CPU_PU_DELT_TIMER : R/W; bitpos: [5:3]; default: 0;
 *  need_des
 */
#define PMU_PD_HP_CPU_PU_DELT_TIMER    0x00000007U
#define PMU_PD_HP_CPU_PU_DELT_TIMER_M  (PMU_PD_HP_CPU_PU_DELT_TIMER_V << PMU_PD_HP_CPU_PU_DELT_TIMER_S)
#define PMU_PD_HP_CPU_PU_DELT_TIMER_V  0x00000007U
#define PMU_PD_HP_CPU_PU_DELT_TIMER_S  3
/** PMU_PD_MODEM_TOP_PU_DELT_TIMER : R/W; bitpos: [8:6]; default: 0;
 *  need_des
 */
#define PMU_PD_MODEM_TOP_PU_DELT_TIMER    0x00000007U
#define PMU_PD_MODEM_TOP_PU_DELT_TIMER_M  (PMU_PD_MODEM_TOP_PU_DELT_TIMER_V << PMU_PD_MODEM_TOP_PU_DELT_TIMER_S)
#define PMU_PD_MODEM_TOP_PU_DELT_TIMER_V  0x00000007U
#define PMU_PD_MODEM_TOP_PU_DELT_TIMER_S  6
/** PMU_PD_MODEM_PWR_PU_DELT_TIMER : R/W; bitpos: [11:9]; default: 0;
 *  need_des
 */
#define PMU_PD_MODEM_PWR_PU_DELT_TIMER    0x00000007U
#define PMU_PD_MODEM_PWR_PU_DELT_TIMER_M  (PMU_PD_MODEM_PWR_PU_DELT_TIMER_V << PMU_PD_MODEM_PWR_PU_DELT_TIMER_S)
#define PMU_PD_MODEM_PWR_PU_DELT_TIMER_V  0x00000007U
#define PMU_PD_MODEM_PWR_PU_DELT_TIMER_S  9
/** PMU_PD_HP_CNNT_PU_DELT_TIMER : R/W; bitpos: [14:12]; default: 0;
 *  need_des
 */
#define PMU_PD_HP_CNNT_PU_DELT_TIMER    0x00000007U
#define PMU_PD_HP_CNNT_PU_DELT_TIMER_M  (PMU_PD_HP_CNNT_PU_DELT_TIMER_V << PMU_PD_HP_CNNT_PU_DELT_TIMER_S)
#define PMU_PD_HP_CNNT_PU_DELT_TIMER_V  0x00000007U
#define PMU_PD_HP_CNNT_PU_DELT_TIMER_S  12
/** PMU_PD_HP_ALIVE_PU_DELT_TIMER : R/W; bitpos: [17:15]; default: 0;
 *  need_des
 */
#define PMU_PD_HP_ALIVE_PU_DELT_TIMER    0x00000007U
#define PMU_PD_HP_ALIVE_PU_DELT_TIMER_M  (PMU_PD_HP_ALIVE_PU_DELT_TIMER_V << PMU_PD_HP_ALIVE_PU_DELT_TIMER_S)
#define PMU_PD_HP_ALIVE_PU_DELT_TIMER_V  0x00000007U
#define PMU_PD_HP_ALIVE_PU_DELT_TIMER_S  15

/** PMU_EXT_LDO_CTRL_REG register
 *  need_des
 */
#define PMU_EXT_LDO_CTRL_REG (DR_REG_PMU_BASE + 0x218)
/** PMU_EXT_LDO_TIE_HIGH : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define PMU_EXT_LDO_TIE_HIGH    (BIT(0))
#define PMU_EXT_LDO_TIE_HIGH_M  (PMU_EXT_LDO_TIE_HIGH_V << PMU_EXT_LDO_TIE_HIGH_S)
#define PMU_EXT_LDO_TIE_HIGH_V  0x00000001U
#define PMU_EXT_LDO_TIE_HIGH_S  0
/** PMU_EXT_LDO_EN_VDET : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define PMU_EXT_LDO_EN_VDET    (BIT(1))
#define PMU_EXT_LDO_EN_VDET_M  (PMU_EXT_LDO_EN_VDET_V << PMU_EXT_LDO_EN_VDET_S)
#define PMU_EXT_LDO_EN_VDET_V  0x00000001U
#define PMU_EXT_LDO_EN_VDET_S  1
/** PMU_EXT_CUR_LIM : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define PMU_EXT_CUR_LIM    (BIT(2))
#define PMU_EXT_CUR_LIM_M  (PMU_EXT_CUR_LIM_V << PMU_EXT_CUR_LIM_S)
#define PMU_EXT_CUR_LIM_V  0x00000001U
#define PMU_EXT_CUR_LIM_S  2
/** PMU_EXT_LDO_MUL : R/W; bitpos: [5:3]; default: 0;
 *  need_des
 */
#define PMU_EXT_LDO_MUL    0x00000007U
#define PMU_EXT_LDO_MUL_M  (PMU_EXT_LDO_MUL_V << PMU_EXT_LDO_MUL_S)
#define PMU_EXT_LDO_MUL_V  0x00000007U
#define PMU_EXT_LDO_MUL_S  3
/** PMU_EXT_LDO_DREF : R/W; bitpos: [9:6]; default: 0;
 *  need_des
 */
#define PMU_EXT_LDO_DREF    0x0000000FU
#define PMU_EXT_LDO_DREF_M  (PMU_EXT_LDO_DREF_V << PMU_EXT_LDO_DREF_S)
#define PMU_EXT_LDO_DREF_V  0x0000000FU
#define PMU_EXT_LDO_DREF_S  6

/** PMU_DEBUG_RO_REG register
 *  used for future potential eco, others don't care
 */
#define PMU_DEBUG_RO_REG (DR_REG_PMU_BASE + 0x21c)
/** PMU_CPU_PWR_STATE : RO; bitpos: [5:0]; default: 0;
 *  need_des
 */
#define PMU_CPU_PWR_STATE    0x0000003FU
#define PMU_CPU_PWR_STATE_M  (PMU_CPU_PWR_STATE_V << PMU_CPU_PWR_STATE_S)
#define PMU_CPU_PWR_STATE_V  0x0000003FU
#define PMU_CPU_PWR_STATE_S  0
/** PMU_IO_0P2A_OVDET : RO; bitpos: [6]; default: 0;
 *  need_des
 */
#define PMU_IO_0P2A_OVDET    (BIT(6))
#define PMU_IO_0P2A_OVDET_M  (PMU_IO_0P2A_OVDET_V << PMU_IO_0P2A_OVDET_S)
#define PMU_IO_0P2A_OVDET_V  0x00000001U
#define PMU_IO_0P2A_OVDET_S  6

/** PMU_LPCPU_WAKEUP_CAUSE_REG register
 *  need_des
 */
#define PMU_LPCPU_WAKEUP_CAUSE_REG (DR_REG_PMU_BASE + 0x220)
/** PMU_LPCPU_WAKEUP_CAUSE : RO; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define PMU_LPCPU_WAKEUP_CAUSE    0xFFFFFFFFU
#define PMU_LPCPU_WAKEUP_CAUSE_M  (PMU_LPCPU_WAKEUP_CAUSE_V << PMU_LPCPU_WAKEUP_CAUSE_S)
#define PMU_LPCPU_WAKEUP_CAUSE_V  0xFFFFFFFFU
#define PMU_LPCPU_WAKEUP_CAUSE_S  0

/** PMU_BACKUP_WAIT_TARGET_REG register
 *  need_des
 */
#define PMU_BACKUP_WAIT_TARGET_REG (DR_REG_PMU_BASE + 0x224)
/** PMU_BACKUP_WAIT_TARGET : R/W; bitpos: [3:0]; default: 15;
 *  need_des
 */
#define PMU_BACKUP_WAIT_TARGET    0x0000000FU
#define PMU_BACKUP_WAIT_TARGET_M  (PMU_BACKUP_WAIT_TARGET_V << PMU_BACKUP_WAIT_TARGET_S)
#define PMU_BACKUP_WAIT_TARGET_V  0x0000000FU
#define PMU_BACKUP_WAIT_TARGET_S  0

/** PMU_DATE_REG register
 *  need_des
 */
#define PMU_DATE_REG (DR_REG_PMU_BASE + 0x3fc)
/** PMU_PMU_DATE : R/W; bitpos: [30:0]; default: 2427138;
 *  need_des
 */
#define PMU_PMU_DATE    0x7FFFFFFFU
#define PMU_PMU_DATE_M  (PMU_PMU_DATE_V << PMU_PMU_DATE_S)
#define PMU_PMU_DATE_V  0x7FFFFFFFU
#define PMU_PMU_DATE_S  0
/** PMU_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_CLK_EN    (BIT(31))
#define PMU_CLK_EN_M  (PMU_CLK_EN_V << PMU_CLK_EN_S)
#define PMU_CLK_EN_V  0x00000001U
#define PMU_CLK_EN_S  31

#ifdef __cplusplus
}
#endif
